const defaultData = {
  docs: [
    {
      id: 3353261,
      movieId: 535341,
      title: "неприкасаемые",
      type: "Нейтральный",
      review:
        "Говорить что-то сейчас о '1+1' практически не имеет смысла. Фильм стал чуть ли не культовым, и практически нет любителей большого кино, которые бы его не видели или хотя бы не слышали.\r\n\r\nРассказываемая история на самом деле даже не столько драма, сколько повесть, в чем-то жизнеутверждающая. Дружба двух людей из совершенно разных социальных слоев, разных настолько, что их можно считать буквально разными мирами. Дружба людей, которые в иное время не могли пересечься нигде, но трагедия свела-таки их вместе.\r\n\r\n'1+1' это приятный фильм, качественно снятый, хорошо написанный и талантливо сыгранный. Главный экранный дуэт, Франсуа Клюзе и Омар Си, очень хорошо гармонируют вместе, пусть поначалу их образы и смотрятся максимально контрастно. Однако химия между героями определенно чувствуется, и на ней строится львиная доля очарования ленты.\r\n\r\nПравда, есть все же в ленте даже не недостаток, а условие, которая делает фильм достаточно легким для просмотра, несмотря на тяжелое состояние персонажа Клюзе. Филипп до безобразия богат. Богат настолько, что будучи парализованным может позволить себе развлечения и жизнь, какие недоступны большинству физически здоровых людей. Да, безусловно, участь Филиппа не завидная, такого, как говорят, и врагу не пожелаешь. Однако на фоне таких же людей, лишенных доступа к безграничным средствам, по-настоящему сопереживать Филиппу не получается. А фильм благодаря этому выглядит как нечто жизнеутверждающее, о чем я уже сказал, а не как беспросветная чернуха.\r\n\r\nТак или иначе, '1+1' это прекрасный фильм с прекрасными персонажами. Он определенно заслуживает внимания и тех оценок, какими он сейчас может похвастать.",
      date: "2024-02-18T09:19:55.000Z",
      author: "SiberianReview",
      userRating: 612,
      authorId: 44080109,
      createdAt: "2024-03-19T17:22:16.952Z",
      updatedAt: "2024-03-19T17:22:16.952Z",
    },
    {
      id: 3327581,
      movieId: 535341,
      title: "Неважно, кто ты снаружи, главное - кто ты внутри.",
      type: "Позитивный",
      review:
        "Безусловно, лучший из лучших фильмов, которые я смотрела. А смотрела я его с десяток раз! Все потому, что этот фильм о доброте сердца, о внутренней красоте человека, о его душевности.\r\n\r\nГлавные герои фильма - два разных мира. Один мир - богатый, культурный, чинный, правильный. Другой, соответственно, совершенно иной. Бедность, серая и страшная уличная жизнь, в которой люди вязнут, утопают. Но все же объединяет эти два мира - отсутствие счастья изнутри.\r\n\r\nА когда эти миры соединились, они раскрыли в себе то, о чем страждала каждая душа. Искренний смех, радость, непринужденность в отношениях, дружба.\r\n\r\nКстати, о юморе. Это отдельный момент, который следует очень ярко оценить. На протяжении всего фильма вы будете улыбаться, смеяться и хохотать. Но при этом вы не потеряете всю оценку серьезности ситуаций. \r\n\r\nНа самом деле фильм очень правдиво описывает становление крепких отношений между людьми. Два неидеальных человека, два одиноких мира приняли друг друга такими какие они есть. И раскрылись друг другу. Это ведь то, чего ищет каждый в своей жизни. Крепкой дружбы.\r\n\r\nОтличная актерская игра, великолепная режиссерская работа раскрывает всю глубину человеческой души.",
      date: "2023-12-06T17:59:59.000Z",
      author: "Лида Дёгтева",
      userRating: 1,
      authorId: 64362895,
      createdAt: "2023-12-17T13:32:40.982Z",
      updatedAt: "2024-03-19T17:22:16.957Z",
    },
    {
      id: 3322352,
      movieId: 535341,
      title: "Самое страшное не то, что я в кресле, а то, что я без неё.",
      type: "Позитивный",
      review:
        "Когда впервые посмотрел это кино, то смотрел всей семьей и фильм оставил много эмоций. Пересматривая это кино сейчас эмоций стало ещё больше. Это по-прежнему кино, которое не только веселит, но и заставляет задуматься о многих вещах. Хотя при этом оно очень простое,  при этом очень яркое и интересное.\r\n\r\nВо-первых, мне очень понравилась история, которая основанная на реальных событиях. Умеют французы трогать за душу и делают это очень красиво. Режиссёрскому тандему Оливье Накашу и Эрику Толедано удалось создать очень яркую историю, которая непросто трогательная, а весьма поучительная и интересная. Тут нет каких-то неожиданных поворотов и событий от которых можно сказать, что это было вау. Здесь показана простая жизнь на примере двух людей, которые встретились благодаря тому, что один был в инвалидном кресле, а второму нужно было пособие. Врядли кто-то мог предположить из них насколько это всё затянется.\r\n\r\nПомимо отличного режиссёрского тандема конечно стоит выделить актёрский тандем. Франсуа Клюзе\tи Омар Си. Они абсолютно разные по фильму. Они словно две разные планеты. Один богатый и болен, второй беден, но при этом здоров. Но со временем расхождения в социальном статусе и во многом другом не станут преградой для них. Они отлично проводили время. Было много веселого и смешного. Но при этом много серьёзных и важных диалогов, которые меняют каждого из них. \r\n\r\n<b>Франсуа Клюзе.</b> История Филиппа конечно покоряет достаточно быстро. Несмотря на свою болезнь считаю его мужественным и очень стойким человеком. Да он от многого устал, наверно для него его состояние стало нормой жизни к которой он привык. Ему безусловно не хватает эмоций. И эти эмоции конечно появляются  после того, как в его жизни появился Дрисс. И он начинает оживать, и даже несмотря на наглость и грубость последнего, жизнь безусловно его становится очень яркой и насыщенной. Лично мне Филипп всегда нравился именно историей любви про которую он так трепетно рассказывал, словно- это самое важное чего он добился в жизни. И это здорово.\r\n\r\n<b>Омар Си.</b> Дрисс достаточно непрост, я бы сказал, что он очень сложен. Но при этом у него безусловно есть сердце. За всей этой наглостью и грубостью, а довольно часто и хамством скрывается очень глубокий и интересный человек чьи проблемы не давали ему жить полноценно. Работа в лице Филиппа меняет его до неузнаваемости. Да он конечно не изменяет себе и многие привычки и его стиль не меняется, но всё же он становится другим. Именно этот яркий стиль очень подкупает. Он много веселит и смешит, но вместе с тем у него было немало интересны поступков на которые хочется обращать внимание.\r\n\r\n<b>1+1- это фильм, который по-прежнему прекрасно смотреть и наслаждаться. Простотой, яркостью, позитивными моментами. Смотреть на судьбы двух людей, которые из-за определенных обстоятельств стали проводить много времени вместе. И стали довольно близки. История основанная на реальных событиях трогает за душу, веселит, заставляет задуматься о многих вещах. Потрясающий режиссёрский тандем и конечно же актёрский тандем способен растопить лёд уверен и у искушенного зрителя.</b>\r\n\r\n9 из 10",
      date: "2023-11-21T19:30:19.000Z",
      author: "Vad18",
      userRating: 55,
      authorId: 152126098,
      createdAt: "2023-12-17T13:32:40.986Z",
      updatedAt: "2024-03-19T17:22:16.961Z",
    },
  ],
  total: 581,
  limit: 3,
  page: 1,
  pages: 194,
};

export function getUserReviewsMock(page: number, limit: number) {
  if (page === 1 && limit === 10) {
    return { json: () => defaultData };
  }
  return { json: () => defaultData };
}
